//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&& crc16  &&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&
//*文件名称:crc16.c
//*文件作用:
//*文件作者:mmaple
//*创建日期:2013年1月
//&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&


#include "../include/include.h"




//***********************************************************************************************************************
//函数作用:16位高低字节交换
//参数说明:
//注意事项:
//返回说明:无
//***********************************************************************************************************************
uint16 swap_int16(uint16 n)
{
	uint16 temp1,temp2;
	
	temp1=(n>>8)&0x00FF;
	temp2=(n<<8)&0xFF00;
	return temp1|temp2;
}

//***********************************************************************************************************************
//*函数作用:把整数转化成十进制串
//*参数说明:dec---转化成的十进制串 n--要转化的整数
//*注意事项:
//*返回说明:无
//***********************************************************************************************************************
uint8 int_to_dec(uint8 *dec, uint32 n)
{	
	uint8 i=0;
	uint8 result;
	uint32 divisor, remainder;

	remainder=n;
	if(n<0x10000)divisor=10000;
	else divisor=1000000000;
	for(;divisor>0;divisor/=10)
	{
		result=remainder/divisor;
		remainder%=divisor;
		if(result!=0 || divisor==1 || i>0)
		dec[i++]=result+0x30;
	}
	dec[i]=0;
	
	return i;//返回数据位数
}

//***********************************************************************************************************************
//函数作用:把缓冲区内容转化成为hex字符串
//参数说明:buf
//注意事项:
//返回说明:如果相等返回1
//***********************************************************************************************************************
void buf_to_hex_bak(uint8 *hex, uint8 *buf, uint16 length)
{
	uint8 asiic[]="0123456789ABCDEF";
	while(length--)
	{
		*hex++=asiic[(*buf)>>4];
		*hex++=asiic[(*buf++)&0x0F];
	}
	*hex=0;
}
void buf_to_hex(uint8 *hex, uint8 *buf, uint16 buf_length, uint16 *hex_len)
{
	uint16 len_tmp=buf_length;
	uint8 tmp_char='0';
	while(len_tmp--)
	{
		if((*buf)>='a' && (*buf)<='f')
		{
			tmp_char='a';
			
			*hex=((*buf++)-tmp_char+10)<<4;
		}
		else if((*buf)>='A' && (*buf)<='F')
		{
			tmp_char='A';
			
			*hex=((*buf++)-tmp_char+10)<<4;
		}
		else
			{
			tmp_char='0';
			
			*hex=((*buf++)-tmp_char)<<4;
			}
		
		if((*buf)>='a' && (*buf)<='f')
			{
			tmp_char='a';
			
			*hex|=((*buf++)-tmp_char+10)&0x0F;
			}
		else if((*buf)>='A' && (*buf)<='F')
			{
			tmp_char='A';
			
			*hex|=((*buf++)-tmp_char+10)&0x0F;
			}		
		else
			{
			tmp_char='0';
			
			*hex|=((*buf++)-tmp_char)&0x0F;
			}		
		
		buf++;
		hex++;
	}
	*hex=0;
	*hex_len=(buf_length/3);
}

//***********************************************************************************************************************
//*函数作用:把整数转化成hex串
//*参数说明:hex---转化成的hex串 n--要转化的整数
//*注意事项:
//*返回说明:
//***********************************************************************************************************************
void char_to_hex(uint8 *hex, uint8 n)
{
	uint8 asiic[]="0123456789ABCDEF";

	*hex++=asiic[n>>4];
	*hex++=asiic[n&0x0F];
	*hex=0;
}

//***********************************************************************************************************************
//*函数作用:把整数转化成hex串
//*参数说明:hex---转化成的hex串 n--要转化的整数
//*注意事项:
//*返回说明:
//***********************************************************************************************************************
void int_to_hex(uint8 *hex, uint32 n)
{
	uint8 asiic[]="0123456789ABCDEF";

	if(n<0x10000)
	{
		*hex++=asiic[(n>>12)&0x0F];
		*hex++=asiic[(n>>8 )&0x0F];
		*hex++=asiic[(n>>4 )&0x0F];
		*hex++=asiic[(n>>0 )&0x0F];
	}
	else
	{
		*hex++=asiic[(n>>28)&0x0F];
		*hex++=asiic[(n>>24)&0x0F];
		*hex++=asiic[(n>>20)&0x0F];
		*hex++=asiic[(n>>16)&0x0F];
		*hex++=asiic[(n>>12)&0x0F];
		*hex++=asiic[(n>>8 )&0x0F];
		*hex++=asiic[(n>>4 )&0x0F];
		*hex++=asiic[(n>>0 )&0x0F];	
	}
	*hex=0;
}
void int16_to_hex(uint8 *hex, uint32 n)
{
	uint8 asiic[]="0123456789ABCDEF";

	if(n<0x10000)
	{
		*hex++=asiic[(n>>4 )&0x0F];
		*hex++=asiic[(n>>0 )&0x0F];
	}

	*hex=0;
}

//***********************************************************************************************************************
//函数作用:把hex字符串--转化为整数
//参数说明:hex---给定的串
//注意事项:
//返回说明:返回是否成功
//***********************************************************************************************************************
static uint8 xdigitvalue(uint8 isdigit)//判断是否是十六进制数字
{
	if(isdigit>='0' && isdigit<='9')
	{
		return isdigit-'0';
	}
	else if(isdigit>='A' && isdigit<='F')
	{
		return isdigit-'7';
	}
	else if (isdigit >= 'a' && isdigit <= 'f') 
	{
		return 10 + (isdigit - 'a');
	}
	else
	{
		return 0xFF;
	}
}
uint8 hex_to_int8(uint8 *hex, uint8 *n)
{
	char i,k;

	*n=0;
	for(k=0;k<2;k++)
	{
		if((i=xdigitvalue(*(hex+k)))==0xFF)return 0;
		*n=((*n)<<4)|i;
	}
	return 1;
}
uint8 hex_to_int16(uint8 *hex, uint16 *n)
{

	return 1;
}
uint8 hex_to_int32(uint8 *hex, uint32 *n)
{

	return 1;
}
uint16 hex_to_buf(uint8 *hex, uint8 *buf)
{
	uint16 length=0;

	return length;
}


uint8 dec_to_int8(uint8 *dec, uint8 *n)
{

	return 1;
}

uint8 dec_to_int16(uint8 *dec, uint16 *n)
{

	return 1;
}
uint8 dec_to_int32(uint8 *dec, uint32 *n)
{

	return 1;
}

//***********************************************************************************************************************
//函数作用:将HEX变成BCD码
//参数说明:无
//注意事项:
//返回说明:
//***********************************************************************************************************************
uint8 hex_to_bcd(uint8 hex_code)
{
 uint8 i;
 i=hex_code/10;
 i*=0x10;
 i+=(hex_code%10);
 return i;   
}
//***********************************************************************************************************************
//函数作用:将bcd变成hex码
//参数说明:无
//注意事项:
//返回说明:
//***********************************************************************************************************************
uint8 bcd_to_hex(uint8 bcd_code)
{
 uint8 a;
 uint8 b;
 a=bcd_code;
 a&=0x0F;
 b=a;
 a=bcd_code;
 a&=0xF0;  
 a>>=4;
 a*=10;
 b+=a;
 return b;
}

